<a href="https://colab.research.google.com/github/KomalMano/Story/blob/master/9_Merge_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd 

df1 = pd.DataFrame({
    "city" : ["new york","chicago","orlando","baltimore"],
    "temp" : [21,14,35,32]
})
df1

        city  temp
0   new york    21
1    chicago    14
2    orlando    35
3  baltimore    32

In [8]:
df2 = pd.DataFrame({
    "city" : ["chicago","new york","san francisco"],
    "humidity" : [65,68,71]
})
df2

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [10]:
#i want to join these 2 dataframes to create 1 single dataframe which contains both temp and humidity
#both dataframes common data come, now these are called inner joins.
df3 = pd.merge(df1,df2,on="city")
df3

       city  temp  humidity
0  new york    21        68
1   chicago    14        65

In [14]:
#for outer joins means all the data come from both dataframes. outer joins are also called unnion 
df3 = pd.merge(df1,df2, on="city", how="outer")
df3

            city  temp  humidity
0       new york  21.0      68.0
1        chicago  14.0      65.0
2        orlando  35.0       NaN
3      baltimore  32.0       NaN
4  san francisco   NaN      71.0

In [17]:
#the inner join is default bcz when u dont supply how inner column .
#u can search pandas merge documentation 
df3 = pd.merge(df1,df2, how="inner")
df3

       city  temp  humidity
0  new york    21        68
1   chicago    14        65

In [20]:
#left means involve the common elements and left side elements decided ur merge method df1 is left and df2 2nd
#another join is called left join 
df3 = pd.merge(df1,df2,on="city", how="left")
df3

        city  temp  humidity
0   new york    21      68.0
1    chicago    14      65.0
2    orlando    35       NaN
3  baltimore    32       NaN

In [21]:
df3 = pd.merge(df1,df2,on="city", how="right")
df3

            city  temp  humidity
0        chicago  14.0        65
1       new york  21.0        68
2  san francisco   NaN        71

In [23]:
#indicator means where we get the data from
df3 = pd.merge(df1,df2,on="city", how="outer", indicator=True)
df3

            city  temp  humidity      _merge
0       new york  21.0      68.0        both
1        chicago  14.0      65.0        both
2        orlando  35.0       NaN   left_only
3      baltimore  32.0       NaN   left_only
4  san francisco   NaN      71.0  right_only

In [24]:
#suffixes means comman columns 
df1 = pd.DataFrame({
    "city":["new york","chicago","orlando","baltimore"],
    "temp":[21,14,35,38],
    "humidity":[65,68,71,75]
})
df1

        city  temp  humidity
0   new york    21        65
1    chicago    14        68
2    orlando    35        71
3  baltimore    38        75

In [25]:
df2 = pd.DataFrame({
    "city":["chicago","new york","san diego"],
    "temp":[21,14,71],
    "humidity":[65,68,71]
})
df2

        city  temp  humidity
0    chicago    21        65
1   new york    14        68
2  san diego    71        71

In [27]:
#in which temp and humidity have seperate column bcz both have different values in different data frames
df3 = pd.merge(df1,df2, on="city")
df3

       city  temp_x  humidity_x  temp_y  humidity_y
0  new york      21          65      14          68
1   chicago      14          68      21          65

In [29]:
#when u use suffixes then x and y are converted into left and right
df3 = pd.merge(df1,df2, on="city" , suffixes=('_left','_right'))
df3

       city  temp_left  humidity_left  temp_right  humidity_right
0  new york         21             65          14              68
1   chicago         14             68          21              65